In [1]:
import pandas as pd

In [3]:
data=[19,19,12,12]
x=pd.Series(data)
x.head()

0    19
1    19
2    12
3    12
dtype: int64

In [7]:
data1={"num":[10,20,199],
       "id":[1,2,3]}
y=pd.DataFrame(data1,index=["a","b","c"])
y.head()

   num  id
a   10   1
b   20   2
c  199   3

In [11]:
datas=pd.read_csv("transactions.csv")

In [13]:
datas.head()

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1

In [15]:
datas.describe()

       TransactionID    UserID  ProductID   Quantity
count       10.00000  9.000000  10.000000  10.000000
mean         5.50000  3.444444   3.400000   2.400000
std          3.02765  2.127858   1.074968   1.712698
min          1.00000  1.000000   2.000000   1.000000
25%          3.25000  2.000000   2.250000   1.000000
50%          5.50000  3.000000   4.000000   2.000000
75%          7.75000  3.000000   4.000000   3.000000
max         10.00000  7.000000   5.000000   6.000000

In [17]:
datas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   UserID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   Quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes

In [23]:
df=datas.sort_values(by=["Quantity","TransactionID"],ascending=[True,False])
df.head(10)

   TransactionID TransactionDate  UserID  ProductID  Quantity
6              7      2013-12-30     3.0          4         1
4              5      2013-06-06     2.0          4         1
2              3      2011-06-16     3.0          3         1
1              2      2011-05-26     3.0          4         1
0              1      2010-08-21     7.0          2         1
8              9      2015-04-24     7.0          4         3
7              8      2014-04-24     NaN          2         3
3              4      2012-08-26     1.0          2         3
9             10      2016-05-08     3.0          4         4
5              6      2013-12-23     2.0          5         6

In [27]:
df[df["Quantity"]>1].head()

   TransactionID TransactionDate  UserID  ProductID  Quantity
8              9      2015-04-24     7.0          4         3
7              8      2014-04-24     NaN          2         3
3              4      2012-08-26     1.0          2         3
9             10      2016-05-08     3.0          4         4
5              6      2013-12-23     2.0          5         6

In [31]:
df.isnull().sum()

TransactionID      0
TransactionDate    0
UserID             0
ProductID          0
Quantity           0
dtype: int64

In [68]:
z=df.Quantity[[0,1]]
print(z)

0    1
1    1
Name: Quantity, dtype: int64

In [70]:
set=df[df['Quantity']>1][['TransactionID','TransactionDate']]

In [72]:
print(set)

   TransactionID TransactionDate
8              9      2015-04-24
7              8      2014-04-24
3              4      2012-08-26
9             10      2016-05-08
5              6      2013-12-23

In [74]:
print(df)

   TransactionID TransactionDate    UserID  ProductID  Quantity
6              7      2013-12-30  3.000000          4         1
4              5      2013-06-06  2.000000          4         1
2              3      2011-06-16  3.000000          3         1
1              2      2011-05-26  3.000000          4         1
0              1      2010-08-21  7.000000          2         1
8              9      2015-04-24  7.000000          4         3
7              8      2014-04-24  3.444444          2         3
3              4      2012-08-26  1.000000          2         3
9             10      2016-05-08  3.000000          4         4
5              6      2013-12-23  2.000000          5         6

In [90]:
set2=df[df['ProductID']==4][['TransactionID','UserID']]
set3=set2.sort_values(by=['TransactionID'],ascending=[True])
set3.head()

   TransactionID  UserID
1              2     3.0
4              5     2.0
6              7     3.0
8              9     7.0
9             10     3.0

In [112]:
cset=df[['TransactionID','UserID']]
print(cset)

                  TransactionID    UserID
6 1970-01-01 00:00:00.000000007  3.000000
4 1970-01-01 00:00:00.000000005  2.000000
2 1970-01-01 00:00:00.000000003  3.000000
1 1970-01-01 00:00:00.000000002  3.000000
0 1970-01-01 00:00:00.000000001  7.000000
8 1970-01-01 00:00:00.000000009  7.000000
7 1970-01-01 00:00:00.000000008  3.444444
3 1970-01-01 00:00:00.000000004  1.000000
9 1970-01-01 00:00:00.000000010  3.000000
5 1970-01-01 00:00:00.000000006  2.000000

In [98]:
subset= df[[col for col in df.columns if col not in ['UserID']]]

In [100]:
print(subset)

   TransactionID TransactionDate  ProductID  Quantity
6              7      2013-12-30          4         1
4              5      2013-06-06          4         1
2              3      2011-06-16          3         1
1              2      2011-05-26          4         1
0              1      2010-08-21          2         1
8              9      2015-04-24          4         3
7              8      2014-04-24          2         3
3              4      2012-08-26          2         3
9             10      2016-05-08          4         4
5              6      2013-12-23          5         6

In [118]:
df['TransactionDate']=pd.DataFrame(df['TransactionDate'])
print(df)

                  TransactionID               TransactionDate    UserID  \
6 1970-01-01 00:00:00.000000007 1970-01-01 00:00:00.000000007  3.000000
4 1970-01-01 00:00:00.000000005 1970-01-01 00:00:00.000000005  2.000000
2 1970-01-01 00:00:00.000000003 1970-01-01 00:00:00.000000003  3.000000
1 1970-01-01 00:00:00.000000002 1970-01-01 00:00:00.000000002  3.000000
0 1970-01-01 00:00:00.000000001 1970-01-01 00:00:00.000000001  7.000000
8 1970-01-01 00:00:00.000000009 1970-01-01 00:00:00.000000009  7.000000
7 1970-01-01 00:00:00.000000008 1970-01-01 00:00:00.000000008  3.444444
3 1970-01-01 00:00:00.000000004 1970-01-01 00:00:00.000000004  1.000000
9 1970-01-01 00:00:00.000000010 1970-01-01 00:00:00.000000010  3.000000
5 1970-01-01 00:00:00.000000006 1970-01-01 00:00:00.000000006  2.000000

   ProductID  Quantity
6          4         1
4          4         1
2          3         1
1          4         1
0          2         1
8          4         3
7          2         3
3          2         3
9          4         4
5          5         6